{"backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 32, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_1", "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_size": [5, 5], "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"rate": 0.07, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "data_format": "channels_last", "name": "conv2d_2", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"rate": 0.07, "trainable": true, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 64, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_3", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same"}}, {"class_name": "BatchNormalization", "config": {"axis": -1, "gamma_constraint": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "center": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dropout", "config": {"rate": 0.07, "trainable": true, "name": "dropout_3"}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "filters": 3, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "data_format": "channels_last", "name": "conv2d_4", "activity_regularizer": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same"}}], "keras_version": "2.0.4", "class_name": "Sequential"}